#a) Напишете програма, която при подадено цяло число n, принтира всяко число i между 1 и n.
#б) Същото, но принтирайки само четните числа между 1 и n.
#в) Принтирайте числата между n и n^2, които се делят на 3.
#г) Принтирайте сбора на числата между 1 и n^2.
#д) Принтирайте n! при подадено число n

n=int(input("Please enter the whole number: "))

i=0
o=1
#for i in range(2,n+1,2):
#    print(i)

#for i in range(n,n**2, 3):
#    print(i)

#for i in range(1,n**2,1):
#    o+=i
#print(o)

for i in range(1,n+1,1):
    o*=i
print(o)